## [Terraform Plan Summary]
| 항목            | 값 |
|-----------------|-----|
| **Status**      | `success` |
| **Directory**   | `identity-team-account/organization/organizations`  |
| **Executed At** | `2025-07-29 14:35:45 UTC` |

---

### Plan Output
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_organizations_delegated_administrator.security_delegates["detective.amazonaws.com"] must be replaced
-/+ resource "aws_organizations_delegated_administrator" "security_delegates" {
      ~ account_id              = "694318440367" -> "502676416967" # forces replacement
      ~ arn                     = "arn:aws:organizations::433331841346:account/o-aew1m4e394/694318440367" -> (known after apply)
      ~ delegation_enabled_date = "2025-06-03T11:55:42Z" -> (known after apply)
      ~ email                   = "whs-cloudfence+security-team@googlegroups.com" -> (known after apply)
      ~ id                      = "694318440367/detective.amazonaws.com" -> (known after apply)
      ~ joined_method           = "CREATED" -> (known after apply)
      ~ joined_timestamp        = "2025-06-03T11:55:26Z" -> (known after apply)
      ~ name                    = "security-team-account" -> (known after apply)
      ~ status                  = "ACTIVE" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_organizations_delegated_administrator.security_delegates["guardduty.amazonaws.com"] must be replaced
-/+ resource "aws_organizations_delegated_administrator" "security_delegates" {
      ~ account_id              = "694318440367" -> "502676416967" # forces replacement
      ~ arn                     = "arn:aws:organizations::433331841346:account/o-aew1m4e394/694318440367" -> (known after apply)
      ~ delegation_enabled_date = "2025-06-03T11:55:38Z" -> (known after apply)
      ~ email                   = "whs-cloudfence+security-team@googlegroups.com" -> (known after apply)
      ~ id                      = "694318440367/guardduty.amazonaws.com" -> (known after apply)
      ~ joined_method           = "CREATED" -> (known after apply)
      ~ joined_timestamp        = "2025-06-03T11:55:26Z" -> (known after apply)
      ~ name                    = "security-team-account" -> (known after apply)
      ~ status                  = "ACTIVE" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_organizations_delegated_administrator.security_delegates["inspector2.amazonaws.com"] will be created
  + resource "aws_organizations_delegated_administrator" "security_delegates" {
      + account_id              = "502676416967"
      + arn                     = (known after apply)
      + delegation_enabled_date = (known after apply)
      + email                   = (known after apply)
      + id                      = (known after apply)
      + joined_method           = (known after apply)
      + joined_timestamp        = (known after apply)
      + name                    = (known after apply)
      + service_principal       = "inspector2.amazonaws.com"
      + status                  = (known after apply)
    }

  # aws_organizations_delegated_administrator.security_delegates["securityhub.amazonaws.com"] must be replaced
-/+ resource "aws_organizations_delegated_administrator" "security_delegates" {
      ~ account_id              = "694318440367" -> "502676416967" # forces replacement
      ~ arn                     = "arn:aws:organizations::433331841346:account/o-aew1m4e394/694318440367" -> (known after apply)
      ~ delegation_enabled_date = "2025-06-03T11:55:40Z" -> (known after apply)
      ~ email                   = "whs-cloudfence+security-team@googlegroups.com" -> (known after apply)
      ~ id                      = "694318440367/securityhub.amazonaws.com" -> (known after apply)
      ~ joined_method           = "CREATED" -> (known after apply)
      ~ joined_timestamp        = "2025-06-03T11:55:26Z" -> (known after apply)
      ~ name                    = "security-team-account" -> (known after apply)
      ~ status                  = "ACTIVE" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 3 to destroy.
```

### Plan Error (if any)
```

```